TAONAW.org
#+TITLE: TAONAW Hugo Version
#+OPTIONS: num:nil toc:nil \n:nil
#+TODO: TODO(t) CANCELLED(c) |  WIP(w) PUBLISHED(p)
#+hugo_base_dir: .
#+hugo_auto_set_lastmod: %Y-%m-%d

*** INTRO
  :PROPERTIES:
  :EXPORT_HUGO_SECTION: JRL
  :EXPORT_FILE_NAME: _index
  :END:

**** Who's Josh Rollins 

Josh Rollins is one persistent bastard who was told by his teacher he would never be a writer, so naturally, he had to prove him wrong. Later, he was told by his supervisor he will never make a good IT guy, so he had to prove him wrong, too.

As a non-native New Yorker, he cares too much about living in the city to lead a normal life, which is a good thing, because he has no idea what the word even means.

JR has been writing about sex, tech, and the many things in between for years. He recently woke up from daily grind induced coma. A polyamorist, privacy geek, and a wannabe health nut, he keeps littering the internet with his personal opinions and how-tos about all sorts of stuff mentioned above.

# Personal events and experiences: relationships, depression, sex, polyamory, and all sorts of interesting things. Generally NSFW.

**** Contact
 To contact me, you can write an email: jarss[at]protonmail[dot]com
 Most of the time, I'm on [[https://twitter.com/Josh_Rollins][Twitter]], [[https://www.reddit.com/user/JR121][Reddit]], or [[https://mastodon.technology/web/accounts/115656][Mastodon]]. 

