content/JRL/_index.md
+++
title = "INTRO"
author = ["Josh Rollins"]
lastmod = 2019-02-27T08:45:42-05:00
draft = false
+++

## Who's Josh Rollins {#who-s-josh-rollins}

Josh Rollins is one persistent bastard who was told by his teacher he would never be a writer, so naturally, he had to prove him wrong. Later, he was told by his supervisor he will never make a good IT guy, so he had to prove him wrong, too.

As a non-native New Yorker, he cares too much about living in the city to lead a normal life, which is a good thing, because he has no idea what the word even means.

JR has been writing about sex, tech, and the many things in between for years. He recently woke up from daily grind induced coma. A polyamorist, privacy geek, and a wannabe health nut, he keeps littering the internet with his personal opinions and how-tos about all sorts of stuff mentioned above.


## Contact {#contact}

To contact me, you can write an email: jarss[at]protonmail[dot]com
Most of the time, I'm on [Twitter](https://twitter.com/Josh%5FRollins), [Reddit](https://www.reddit.com/user/JR121), or [Mastodon](https://mastodon.technology/web/accounts/115656).